load/test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 15
      arrivalRate: 1
      rampTo: 10
      name: Warm-up
    # 2. Pre-spike baseline — hold normal load until metrics are steady
    - duration: 15
      arrivalRate: 10
      name: Baseline pre-spike
    # 3. The spike — jump ~10x almost instantly (a 10s ramp keeps it sharp)
    - duration: 10
      arrivalRate: 10
      rampTo: 300
      name: Spike ramp-up
    # 4. Hold the spike briefly
    - duration: 30
      arrivalRate: 300
      name: Spike sustain
    # 5. Drop back to normal just as fast
    - duration: 10
      arrivalRate: 100
      rampTo: 10
      name: Spike ramp-down
    # 6. Post-spike baseline — recovery window, longer than the pre-spike one
    - duration: 60
      arrivalRate: 10
      name: Baseline post-spike
  plugins:
    # No expect plugin here on purpose: in a spike test, 503s during the surge
    # are an expected observation, not a per-request failure. Asserting 200 on
    # every response would mark the shedding we WANT to study as test failures.
    ensure:
      thresholds:
        # Generous on purpose — it tolerates the spike itself but fails the
        # run if latency never recovers. Tighten to see the gate trip.
        - http.response_time.p95: 1000
      conditions:
        - expression: "http.codes.200 > 0"
    # Push Artillery's client-side metrics to Prometheus (via the Pushgateway
    # container) so load and server metrics share one Grafana timeline.
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9091"
        tags:
          - "testId:spike-showcase"

scenarios:
  - name: Hit hello endpoint
    flow:
      - get:
          url: "/api/hello"